tutorials/compressible/rhoCfdemSolverPimple/sqBendLiq/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default             Gauss linear;

    limited             cellLimited Gauss linear 1;
}

divSchemes
{
    default             none;

    div(phi,U)          Gauss linearUpwind limited;
    div(phi,e)          Gauss linearUpwind limited;
    div(phi,epsilon)    Gauss linearUpwind limited;
    div(phi,k)          Gauss linearUpwind limited;
    div(phi,K)          Gauss linearUpwind limited;
    div(phiv,p)         Gauss linearUpwind limited;
    div(phiU,p)         Gauss linearUpwind limited;
    div(((rho*nuEff)*dev2(T(grad(U)))))      Gauss linear;
    div((viscousTerm*dev2(grad(U).T())))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
fluxRequired
{
    p;
}



// ************************************************************************* //
